avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Appli/Common/app/kvs_webrtc/media/stm32_media_port.c
/*
 * STM32N6570 KVS WebRTC port — stm32_media_port.c
 *
 * Implements the AppMediaSourcePort_* interface required by the KVS WebRTC
 * SDK (examples/app_media_source/app_media_source_port.h).
 *
 * Architecture:
 *   DCMIPP PIPE1 → frame buffer  →  MediaEnc_EncodeFrame()  →  H.264 NAL
 *   H.264 NAL  →  onVideoFrameReadyToSendFunc callback (→ PeerConnection)
 *
 * A single FreeRTOS task drives the capture+encode loop.  Audio is not
 * available on this board; the audio callback is never invoked.
 *
 * Copyright (c) 2025 STMicroelectronics / project contributors.
 * SPDX-License-Identifier: Apache-2.0
 */

#include "app_media_source_port.h"   /* SDK interface                       */
#include "media_cam.h"
#include "media_enc.h"
#include "media_cam_config.h"        /* VENC_*_WIDTH / HEIGHT, CAMERA_FPS   */

#include "stm32n6xx_hal.h"

#include "FreeRTOS.h"
#include "task.h"

#include "logging_levels.h"
#define LOG_LEVEL   LOG_INFO
#include "logging.h"

#include "freertos_hooks.h"          /* vPetWatchdog()                       */

#include <assert.h>
#include <string.h>
#include <stdlib.h>

/* ── Raw UART debug ────────────────────────────────────────────────────── */
/* Bounded spin — see rationale in kvs_webrtc_task.c. */
extern void vPetWatchdog( void );
static inline void mp_raw_putc( char c )
{
    for( uint32_t i = 0; i < 600000UL; i++ )
    {
        if( *(volatile uint32_t *)0x56000C1CUL & ( 1UL << 7 ) )
        {
            *(volatile uint32_t *)0x56000C28UL = ( uint32_t ) c;
            return;
        }
    }
    vPetWatchdog();
}
static void mp_raw_puts( const char *s ) { while( *s ) mp_raw_putc( *s++ ); }
static void mp_raw_dec( int v )
{
    char buf[ 12 ];
    int i = 0;
    int neg = 0;
    if( v < 0 ) { neg = 1; v = -v; }
    if( v == 0 ) buf[ i++ ] = '0';
    while( v > 0 ) { buf[ i++ ] = '0' + ( v % 10 ); v /= 10; }
    if( neg ) mp_raw_putc( '-' );
    while( i-- > 0 ) mp_raw_putc( buf[ i ] );
}
static void mp_raw_hex32( uint32_t v )
{
    int i;
    for( i = 7; i >= 0; i-- )
    {
        uint32_t n = ( v >> ( i * 4 ) ) & 0xFU;
        mp_raw_putc( ( char )( n < 10 ? ( '0' + n ) : ( 'a' + n - 10 ) ) );
    }
}

/* ── Frame-content probe ────────────────────────────────────────────────────
 *
 * Sample NV12 Y-plane bytes from 5 column positions across a single row
 * near the middle of the frame and dump them to UART.  If DCMIPP is
 * actually writing the full 1280-pixel row, all 5 should look like
 * plausible luma values (roughly 16..235 for an exposed scene).  If
 * DCMIPP is starving on PSRAM bandwidth and truncating rows, columns
 * past the truncation point will show stale/uninitialised memory —
 * typically repeated patterns or all 0xff / 0x00.                          */
static void mp_probe_frame_row( const uint8_t * pY )
{
    /* 1280 Y-bytes per row; sample row 360 (middle of 720p Y-plane).       */
    const uint32_t ulRowBytes = 1280U;
    const uint32_t ulRowY     = 360U;
    const uint32_t ulRowBase  = ulRowY * ulRowBytes;
    const uint32_t ulCols[ 5 ] = { 0U, 320U, 640U, 960U, 1270U };
    int lI;

    mp_raw_puts( "[M]Y360:" );
    for( lI = 0; lI < 5; lI++ )
    {
        uint8_t ucY = pY[ ulRowBase + ulCols[ lI ] ];
        mp_raw_puts( " c" );
        mp_raw_dec( ( int ) ulCols[ lI ] );
        mp_raw_putc( '=' );
        mp_raw_hex32( ( uint32_t ) ucY );
    }
    mp_raw_puts( "\r\n" );
}

/* ── Configuration ──────────────────────────────────────────────────────── */

/* NV12 raw frame buffers.  At 1280×720 the Y plane is 921,600 bytes and
 * the interleaved UV plane is 460,800 bytes (1.5 bytes/pixel total).  Two
 * ping-pong pairs are allocated for DCMIPP double-buffer mode — DCMIPP
 * alternates between the pair-0 and pair-1 addresses on every VSYNC and
 * the media task encodes the just-completed pair while the other one is
 * being written.                                                          */
#define FRAME_BUF_WIDTH        ( 1280U )
#define FRAME_BUF_HEIGHT       ( 720U )
#define Y_PLANE_BYTES          ( FRAME_BUF_WIDTH * FRAME_BUF_HEIGHT )        /* 921 600 */
#define UV_PLANE_BYTES         ( FRAME_BUF_WIDTH * ( FRAME_BUF_HEIGHT / 2U ) ) /* 460 800 */

/* Encoded H.264 output buffer.  Observed worst-case keyframe size is
 * ~770 KB at 720p; 1.5 MB gives ample margin without wasting PSRAM.      */
#define ENCODED_BUF_BYTES      ( 1536U * 1024U )

/* 16-byte alignment is required by HAL_DCMIPP_CSI_PIPE_SemiPlanarDouble-
 * BufferStart, which rejects unaligned Y/UV addresses.  32-byte alignment
 * keeps cache-line behaviour clean on the M55 D-cache.                    */
static uint8_t ucYPlaneBuf0[ Y_PLANE_BYTES ]
    __attribute__(( section(".psram_bss"), aligned(32) ));
static uint8_t ucYPlaneBuf1[ Y_PLANE_BYTES ]
    __attribute__(( section(".psram_bss"), aligned(32) ));
static uint8_t ucUVPlaneBuf0[ UV_PLANE_BYTES ]
    __attribute__(( section(".psram_bss"), aligned(32) ));
static uint8_t ucUVPlaneBuf1[ UV_PLANE_BYTES ]
    __attribute__(( section(".psram_bss"), aligned(32) ));
static uint8_t ucEncodedFrameBuf[ ENCODED_BUF_BYTES ]
    __attribute__(( section(".psram_bss"), aligned(32) ));

#define MEDIA_TASK_STACK_DEPTH  ( 4096U )
#define MEDIA_TASK_PRIORITY     ( tskIDLE_PRIORITY + 3U )

/* ── Private state ──────────────────────────────────────────────────────── */

typedef struct
{
    OnFrameReadyToSend_t  pfnOnVideoFrame;
    void *                pvVideoCtx;
    TaskHandle_t          xTaskHandle;
    volatile uint8_t      ucRunning;

    uint8_t * pucEncodedFrame;
} MediaPortCtx_t;

static MediaPortCtx_t xMediaCtx;

/* ── Capture+encode loop task ───────────────────────────────────────────── */
/*
 * Strategy: DCMIPP double-buffer (DBM) mode.  The camera pipeline is started
 * with two PSRAM frame buffers (ucRawFrameBuf0 / ucRawFrameBuf1) and DCMIPP
 * alternates between them on every VSYNC.  MediaCam_WaitFrame() blocks on a
 * binary semaphore signalled from the DCMIPP frame-event ISR and returns a
 * pointer to the buffer that was JUST completed — the one DCMIPP is not
 * currently writing.  VENC encodes from that stable buffer while the next
 * frame streams into the other one.  Result: zero tearing, full 15 fps
 * (provided encode + transmit < frame period).
 */

