avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Appli/Common/app/kvs_webrtc/media/stm32_media_port.c
static void prvMediaTask( void * pvParam )
{
    MediaPortCtx_t * pxCtx       = ( MediaPortCtx_t * ) pvParam;
    MediaFrame_t     xFrame;
    int              lEncodedLen;
    uint64_t         ullTimestampUs = 0ULL;
    const uint32_t   ulFramePeriodUs = 1000000UL / CAMERA_FPS;

    LogInfo( "[KVSMedia] Media task started — DCMIPP double-buffer mode." );

    /* Start DCMIPP in ping-pong double-buffer mode with NV12 semi-planar
     * output.  Hardware alternates writes between the (Y0,UV0) pair and
     * the (Y1,UV1) pair on each VSYNC.                                    */
    mp_raw_puts( "[KVSMedia] cam DBL start>\r\n" );
    MediaCam_StartDouble( ucYPlaneBuf0, ucUVPlaneBuf0,
                          ucYPlaneBuf1, ucUVPlaneBuf1,
                          CMW_MODE_CONTINUOUS );
    mp_raw_puts( "[KVSMedia] cam DBL started\r\n" );

    /* Hot-path UART traces removed.  At 115200 baud each byte is ~87us,
     * so the ~120 bytes of per-frame [M]F..topA/B/C/wait/enc/cb/iter-end
     * traces were ~10 ms of busy-wait UART TX in the media task per frame
     * — on top of per-packet traces in h264 helper and the per-frame '*'
     * emitted from the DCMIPP ISR.  At 15 fps (66 ms/frame budget) that
     * left almost no slack for ISP/encode/send, contributing to DCMIPP
     * pipe-1 OVR events.  Now that CAMERA_FPS has been lowered to 10, we
     * have 100 ms/frame — use that budget for actual work, not tracing.
     * A coarse heartbeat every 30 frames remains for live-ness visibility. */
    uint32_t ulFrameNo = 0;
    /* Stage timing, reported in the heartbeat as avg ms/frame: tells us
     * whether the frame budget goes to VENC encode or to the network
     * send path (TLS/TURN chunked sends) without per-frame tracing.     */
    TickType_t xHbLastTick = xTaskGetTickCount();
    uint32_t   ulEncTicks  = 0U;
    uint32_t   ulSendTicks = 0U;
    while( pxCtx->ucRunning )
    {
        TickType_t xStageT0;
        TickType_t xLoopStart = xTaskGetTickCount();
        vPetWatchdog();

        /* Block on frame-event from DCMIPP ISR; returns the just-completed
         * Y+UV pair (DCMIPP has already flipped to writing the OTHER one). */
        MediaCamFrame_t xCamFrame = MediaCam_WaitFrame();

        /* Frame-content probe: confirm DCMIPP actually wrote every column.
         * Runs on the first handful of frames only so we don't flood UART
         * for the entire streaming session.                                */
        if( ulFrameNo < 10U )
        {
            mp_probe_frame_row( xCamFrame.pY );
        }

        /* ISP bookkeeping (AE/AWB) — must be called each frame             */
        MediaCam_IspUpdate();

        /* Encode from the completed (stable) NV12 pair.  VENC reads via
         * its AXI master bypassing the CPU cache — no invalidate needed. */
        xStageT0 = xTaskGetTickCount();
        lEncodedLen = MediaEnc_EncodeFrame( xCamFrame.pY,
                                            xCamFrame.pUV,
                                            pxCtx->pucEncodedFrame,
                                            ENCODED_BUF_BYTES,
                                            0 /* no forced IDR */ );
        ulEncTicks += ( uint32_t ) ( xTaskGetTickCount() - xStageT0 );

        if( lEncodedLen > 0 )
        {
            SCB_InvalidateDCache_by_Addr( ( uint32_t * ) pxCtx->pucEncodedFrame,
                                           ( int32_t ) lEncodedLen );

            xFrame.pData        = pxCtx->pucEncodedFrame;
            xFrame.size         = ( uint32_t ) lEncodedLen;
            xFrame.timestampUs  = ullTimestampUs;
            xFrame.trackKind    = TRANSCEIVER_TRACK_KIND_VIDEO;
            xFrame.freeData     = 0;   /* buffer is static — do not free   */

            if( pxCtx->pfnOnVideoFrame != NULL )
            {
                xStageT0 = xTaskGetTickCount();
                ( void ) pxCtx->pfnOnVideoFrame( pxCtx->pvVideoCtx, &xFrame );
                ulSendTicks += ( uint32_t ) ( xTaskGetTickCount() - xStageT0 );
            }

            ullTimestampUs += ulFramePeriodUs;
        }
        else
        {
            LogWarn( "[KVSMedia] H.264 encode failed (ret=%d), skipping frame.",
                     lEncodedLen );
        }

        /* Heartbeat every 30 frames (≈3s @ 10fps): frame#, encoded bytes,
         * heap, stack high-water-mark, DCMIPP OVR count.  Keeps enough
         * visibility to spot a freeze without saturating the UART in the
         * hot path.                                                        */
        if( ( ulFrameNo % 30U ) == 0U )
        {
            extern volatile uint32_t g_dcmipp_ovr_count;
            mp_raw_puts( "[M] F" ); mp_raw_dec( ( int ) ulFrameNo );
            mp_raw_puts( " len=" ); mp_raw_dec( lEncodedLen );
            mp_raw_puts( " heap=" ); mp_raw_dec( ( int ) xPortGetFreeHeapSize() );
            mp_raw_puts( " hwm=" ); mp_raw_dec( ( int ) uxTaskGetStackHighWaterMark( NULL ) );
            mp_raw_puts( " ovr=" ); mp_raw_dec( ( int ) g_dcmipp_ovr_count );
            /* Avg ms/frame since last heartbeat: encode stage, send stage,
             * and total frame period (1000/per = actual fps).             */
            {
                TickType_t xHbNow = xTaskGetTickCount();
                uint32_t ulFrames = ( ulFrameNo == 0U ) ? 1U : 30U;
                mp_raw_puts( " enc=" ); mp_raw_dec( ( int ) ( ulEncTicks / ulFrames ) );
                mp_raw_puts( " snd=" ); mp_raw_dec( ( int ) ( ulSendTicks / ulFrames ) );
                mp_raw_puts( " per=" ); mp_raw_dec( ( int ) ( ( uint32_t ) ( xHbNow - xHbLastTick ) / ulFrames ) );
                xHbLastTick = xHbNow;
                ulEncTicks = 0U;
                ulSendTicks = 0U;
            }
            mp_raw_puts( "\r\n" );
        }

        ulFrameNo++;
        ( void ) xLoopStart;   /* pacing is now handled by WaitFrame blocking */
    }

    /* Stop the DCMIPP camera pipeline + sensor before exiting so the
     * next viewer session finds the pipe in READY state and
     * is_camera_started == 0.  Without this, the pipe stays BUSY and
     * SemiPlanarDoubleBufferStart silently fails on re-entry →
     * permanent camera freeze for all subsequent viewers.              */
    MediaCam_Stop();

    LogInfo( "[KVSMedia] Media task stopped." );
    pxCtx->xTaskHandle = NULL;   /* signal completion before self-delete */
    vTaskDelete( NULL );
}

