avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Appli/Common/app/kvs_webrtc/media/stm32_media_port.c
/* ── XSPI1 PSRAM (APS256XX) initialisation ─────────────────────────────── */
/*
 * The STM32N6570-DK has an AP Memory APS256XX 256-Mbit OPI PSRAM on XSPI1
 * (memory-mapped at 0x90000000).  The original project never initialised it
 * (EXTMEM_DRIVER_PSRAM = 0), so writes to .psram_bss buffers hit an
 * unconfigured AXI slave → IMPRECISERR bus faults.
 *
 * This function mirrors the BSP sequence from x-cube-n6-ai-h264-usb-uvc:
 *   1. Enable clocks & GPIOs for XSPI1 port 1 (GPIOO / GPIOP)
 *   2. HAL_XSPI_Init  — APMEM_16BITS, 256 MB, prescaler = 3 (slow start)
 *   3. Configure APS256XX mode registers (latency, x16 mode)
 *   4. Switch prescaler to 0 (bypass) for full speed
 *   5. Enable memory-mapped mode (linear-burst read + write, x16, DQS)
 */

static XSPI_HandleTypeDef hxspi_psram;

/* APS256XX commands (from aps256xx.h) */
#define APS_WRITE_REG_CMD          0xC0U
#define APS_READ_LINEAR_BURST_CMD  0x20U
#define APS_WRITE_LINEAR_BURST_CMD 0xA0U

static int prvPsramWriteReg( uint32_t ulAddr, uint8_t ucVal )
{
    XSPI_RegularCmdTypeDef xCmd = { 0 };

    xCmd.OperationType      = HAL_XSPI_OPTYPE_COMMON_CFG;
    xCmd.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
    xCmd.InstructionWidth   = HAL_XSPI_INSTRUCTION_8_BITS;
    xCmd.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
    xCmd.Instruction        = APS_WRITE_REG_CMD;
    xCmd.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
    xCmd.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
    xCmd.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
    xCmd.Address            = ulAddr;
    xCmd.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
    xCmd.DataMode           = HAL_XSPI_DATA_8_LINES;
    xCmd.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
    xCmd.DataLength         = 2;
    xCmd.DummyCycles        = 0;
    xCmd.DQSMode            = HAL_XSPI_DQS_DISABLE;

    if( HAL_XSPI_Command( &hxspi_psram, &xCmd, HAL_XSPI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
        return -1;
    if( HAL_XSPI_Transmit( &hxspi_psram, &ucVal, HAL_XSPI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
        return -1;
    return 0;
}

static int prvPsramEnableMemoryMapped( void )
{
    XSPI_RegularCmdTypeDef   xCmd  = { 0 };
    XSPI_MemoryMappedTypeDef xMmap = { 0 };

    /* Write-path command config (linear burst, x16, write-latency 7) */
    xCmd.OperationType      = HAL_XSPI_OPTYPE_WRITE_CFG;
    xCmd.InstructionMode    = HAL_XSPI_INSTRUCTION_8_LINES;
    xCmd.InstructionWidth   = HAL_XSPI_INSTRUCTION_8_BITS;
    xCmd.InstructionDTRMode = HAL_XSPI_INSTRUCTION_DTR_DISABLE;
    xCmd.Instruction        = APS_WRITE_LINEAR_BURST_CMD;
    xCmd.AddressMode        = HAL_XSPI_ADDRESS_8_LINES;
    xCmd.AddressWidth       = HAL_XSPI_ADDRESS_32_BITS;
    xCmd.AddressDTRMode     = HAL_XSPI_ADDRESS_DTR_ENABLE;
    xCmd.AlternateBytesMode = HAL_XSPI_ALT_BYTES_NONE;
    xCmd.DataMode           = HAL_XSPI_DATA_16_LINES;
    xCmd.DataDTRMode        = HAL_XSPI_DATA_DTR_ENABLE;
    xCmd.DummyCycles        = 6;   /* WriteLatency 7 → dummy = 7–1 */
    xCmd.DQSMode            = HAL_XSPI_DQS_ENABLE;

    if( HAL_XSPI_Command( &hxspi_psram, &xCmd, HAL_XSPI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
        return -1;

    /* Read-path command config (linear burst, x16, read-latency 7) */
    xCmd.OperationType = HAL_XSPI_OPTYPE_READ_CFG;
    xCmd.Instruction   = APS_READ_LINEAR_BURST_CMD;
    xCmd.DummyCycles   = 6;   /* ReadLatency 7 → dummy = 7–1 */

    if( HAL_XSPI_Command( &hxspi_psram, &xCmd, HAL_XSPI_TIMEOUT_DEFAULT_VALUE ) != HAL_OK )
        return -1;

    /* Activate memory-mapped mode */
    xMmap.TimeOutActivation = HAL_XSPI_TIMEOUT_COUNTER_DISABLE;

    if( HAL_XSPI_MemoryMapped( &hxspi_psram, &xMmap ) != HAL_OK )
        return -1;

    return 0;
}

static void prvPsramHex32( uint32_t v )
{
    static const char hex[] = "0123456789ABCDEF";
    char buf[11];
    buf[0] = '0'; buf[1] = 'x';
    for( int i = 7; i >= 0; i-- )
        buf[2 + (7-i)] = hex[ (v >> (i*4)) & 0xF ];
    buf[10] = 0;
    mp_raw_puts( buf );
}

static void prvPsramInit( void )
{
    GPIO_InitTypeDef  xGpio  = { 0 };
    XSPIM_CfgTypeDef  xXspim = { 0 };
    uint32_t          ulClk;
    HAL_StatusTypeDef rc;

    mp_raw_puts( "[PSRAM] init>\r\n" );

    /* ── 1. Power & clocks ─────────────────────────────────────────────── */
    __HAL_RCC_PWR_CLK_ENABLE();
    HAL_PWREx_EnableVddIO2();
    HAL_PWREx_ConfigVddIORange( PWR_VDDIO2, PWR_VDDIO_RANGE_1V8 );

    __HAL_RCC_XSPI1_CLK_ENABLE();
    __HAL_RCC_XSPI1_FORCE_RESET();
    __HAL_RCC_XSPI1_RELEASE_RESET();

    __HAL_RCC_XSPIM_CLK_ENABLE();
    /* Do NOT reset XSPIM — it is shared with XSPI2 (NOR flash) */

    __HAL_RCC_GPIOO_CLK_ENABLE();
    __HAL_RCC_GPIOP_CLK_ENABLE();

    mp_raw_puts( "[PSRAM] clk OK\r\n" );

    /* ── 2. GPIO — GPIOO: CS(0), DQS0(2), DQS1(3), CLK(4) ────────────── */
    xGpio.Mode      = GPIO_MODE_AF_PP;
    xGpio.Pull      = GPIO_PULLUP;
    xGpio.Speed     = GPIO_SPEED_FREQ_VERY_HIGH;
    xGpio.Alternate = GPIO_AF9_XSPIM_P1;

    xGpio.Pin = GPIO_PIN_0;
    HAL_GPIO_Init( GPIOO, &xGpio );
    xGpio.Pin = GPIO_PIN_2;
    HAL_GPIO_Init( GPIOO, &xGpio );
    xGpio.Pin = GPIO_PIN_3;
    HAL_GPIO_Init( GPIOO, &xGpio );
    xGpio.Pin = GPIO_PIN_4;
    HAL_GPIO_Init( GPIOO, &xGpio );

    /* GPIOP: D0..D15 (pins 0‥15) */
    xGpio.Pin = GPIO_PIN_0  | GPIO_PIN_1  | GPIO_PIN_2  | GPIO_PIN_3  |
                GPIO_PIN_4  | GPIO_PIN_5  | GPIO_PIN_6  | GPIO_PIN_7  |
                GPIO_PIN_8  | GPIO_PIN_9  | GPIO_PIN_10 | GPIO_PIN_11 |
                GPIO_PIN_12 | GPIO_PIN_13 | GPIO_PIN_14 | GPIO_PIN_15;
    HAL_GPIO_Init( GPIOP, &xGpio );

    mp_raw_puts( "[PSRAM] gpio OK\r\n" );

    /* ── 3. XSPI1 peripheral init (prescaler = 3 for register config) ── */
    ulClk = HAL_RCCEx_GetPeriphCLKFreq( RCC_PERIPHCLK_XSPI1 );
    mp_raw_puts( "[PSRAM] clkHz=" ); prvPsramHex32( ulClk ); mp_raw_puts( "\r\n" );

    hxspi_psram.Instance                       = XSPI1;
    hxspi_psram.Init.FifoThresholdByte         = 8;
    hxspi_psram.Init.MemoryType                = HAL_XSPI_MEMTYPE_APMEM_16BITS;
    hxspi_psram.Init.MemoryMode                = HAL_XSPI_SINGLE_MEM;
    hxspi_psram.Init.MemorySize                = HAL_XSPI_SIZE_256MB;
    hxspi_psram.Init.MemorySelect              = HAL_XSPI_CSSEL_NCS1;
    hxspi_psram.Init.ChipSelectHighTimeCycle    = 5;
    hxspi_psram.Init.ClockMode                 = HAL_XSPI_CLOCK_MODE_0;
    hxspi_psram.Init.ClockPrescaler            = 3;
    hxspi_psram.Init.SampleShifting            = HAL_XSPI_SAMPLE_SHIFT_NONE;
    hxspi_psram.Init.DelayHoldQuarterCycle     = HAL_XSPI_DHQC_ENABLE;
    hxspi_psram.Init.ChipSelectBoundary        = HAL_XSPI_BONDARYOF_16KB;
    hxspi_psram.Init.FreeRunningClock          = HAL_XSPI_FREERUNCLK_DISABLE;
    hxspi_psram.Init.WrapSize                  = HAL_XSPI_WRAP_NOT_SUPPORTED;
    hxspi_psram.Init.MaxTran                   = 0;
    hxspi_psram.Init.Refresh                   = ( ulClk > 0 )
                                                  ? ( ( 2U * ( ulClk / 3U ) ) / 1000000U ) - 4U
                                                  : 0;

