avnet-iotconnect/iotc-stm32-n6-w6x-kvs-webrtc/Appli/Common/app/kvs_webrtc/media/stm32_media_port.c
    rc = HAL_XSPI_Init( &hxspi_psram );
    mp_raw_puts( "[PSRAM] HAL_XSPI_Init=" ); prvPsramHex32( rc ); mp_raw_puts( "\r\n" );
    if( rc != HAL_OK ) { mp_raw_puts( "[PSRAM] FAIL init\r\n" ); return; }

    /* ── 4. XSPI Manager — route to I/O port 1 ────────────────────────── */
    xXspim.nCSOverride = HAL_XSPI_CSSEL_OVR_NCS1;
    xXspim.IOPort      = HAL_XSPIM_IOPORT_1;
    xXspim.Req2AckTime = 1;
    rc = HAL_XSPIM_Config( &hxspi_psram, &xXspim, HAL_XSPI_TIMEOUT_DEFAULT_VALUE );
    mp_raw_puts( "[PSRAM] XSPIM_Config=" ); prvPsramHex32( rc ); mp_raw_puts( "\r\n" );
    if( rc != HAL_OK ) { mp_raw_puts( "[PSRAM] FAIL xspim\r\n" ); return; }

    /* ── 5. APS256XX mode-register config (slow clock) ─────────────────── */
    int wr;
    wr = prvPsramWriteReg( 0, 0x30 );  /* MR0: Read Latency = 7 */
    mp_raw_puts( "[PSRAM] MR0=" ); prvPsramHex32( wr ); mp_raw_puts( "\r\n" );
    wr = prvPsramWriteReg( 4, 0x20 );  /* MR4: Write Latency = 7 */
    mp_raw_puts( "[PSRAM] MR4=" ); prvPsramHex32( wr ); mp_raw_puts( "\r\n" );
    wr = prvPsramWriteReg( 8, 0x40 );  /* MR8: switch to x16 mode */
    mp_raw_puts( "[PSRAM] MR8=" ); prvPsramHex32( wr ); mp_raw_puts( "\r\n" );

    /* ── 6. Bypass prescaler for full-speed operation ──────────────────── */
    rc = HAL_XSPI_SetClockPrescaler( &hxspi_psram, 0 );
    mp_raw_puts( "[PSRAM] prescaler=" ); prvPsramHex32( rc ); mp_raw_puts( "\r\n" );

    /* ── 7. Enable memory-mapped mode (linear-burst read+write, x16) ─── */
    int mrc = prvPsramEnableMemoryMapped();
    mp_raw_puts( "[PSRAM] mmap=" ); prvPsramHex32( mrc ); mp_raw_puts( "\r\n" );

    if( mrc == 0 )
    {
        /* Quick smoke-test: write/read a word at the PSRAM base */
        volatile uint32_t *pTest = (volatile uint32_t *)0x90000000UL;
        *pTest = 0xDEADBEEFUL;
        __DSB();
        uint32_t v = *pTest;
        mp_raw_puts( "[PSRAM] test=" ); prvPsramHex32( v ); mp_raw_puts( "\r\n" );
    }

    mp_raw_puts( "[PSRAM] init<\r\n" );
}

/* ── Public AppMediaSourcePort_* API ────────────────────────────────────── */

int32_t AppMediaSourcePort_Init( void )
{
    int lWidth, lHeight;

    memset( &xMediaCtx, 0, sizeof( xMediaCtx ) );

    /* Initialise XSPI1 → APS256XX PSRAM in memory-mapped mode before any
     * access to the .psram_bss buffers (frame buffers + VENC allocator).   */
    vPetWatchdog();
    prvPsramInit();

    /* Use static PSRAM buffers (placed in .psram_bss by linker)            */
    xMediaCtx.pucEncodedFrame = ucEncodedFrameBuf;

    /* Camera pipeline init — detects sensor, configures DCMIPP PIPE1      */
    vPetWatchdog();
    mp_raw_puts( "[MP] cam init>\r\n" );
    MediaCam_Init();
    mp_raw_puts( "[MP] cam init<\r\n" );

    vPetWatchdog();
    lWidth  = MediaCam_GetWidth();
    lHeight = MediaCam_GetHeight();
    mp_raw_puts( "[MP] enc init>\r\n" );

    /* Encoder init */
    vPetWatchdog();
    MediaEncConf_t xEncConf = { .lWidth = lWidth, .lHeight = lHeight, .lFps = CAMERA_FPS };
    MediaEnc_Init( &xEncConf );
    vPetWatchdog();
    mp_raw_puts( "[MP] enc init<\r\n" );

    mp_raw_puts( "[MP] READY\r\n" );
    return 0;
}

int32_t AppMediaSourcePort_Start( OnFrameReadyToSend_t pfnOnVideoFrame,
                                  void *               pvVideoCtx,
                                  OnFrameReadyToSend_t pfnOnAudioFrame,
                                  void *               pvAudioCtx )
{
    ( void ) pfnOnAudioFrame;   /* No audio on this board */
    ( void ) pvAudioCtx;

    xMediaCtx.pfnOnVideoFrame = pfnOnVideoFrame;
    xMediaCtx.pvVideoCtx      = pvVideoCtx;
    xMediaCtx.ucRunning       = 1U;

    if( xTaskCreate( prvMediaTask,
                     "KVSMedia",
                     MEDIA_TASK_STACK_DEPTH,
                     &xMediaCtx,
                     MEDIA_TASK_PRIORITY,
                     &xMediaCtx.xTaskHandle ) != pdPASS )
    {
        LogError( "[KVSMedia] Failed to create media task." );
        return -1;
    }

    return 0;
}

void AppMediaSourcePort_Stop( void )
{
    mp_raw_puts( "[MP] Stop> ucRun=" );
    mp_raw_dec( ( int ) xMediaCtx.ucRunning );
    mp_raw_puts( " hdl=" );
    mp_raw_dec( xMediaCtx.xTaskHandle != NULL );
    mp_raw_puts( "\r\n" );

    xMediaCtx.ucRunning = 0U;

    /* Wait for the media task to finish its cleanup (MediaCam_Stop) and
     * self-delete.  WaitFrame has a 2 s timeout, so worst case the task
     * takes ~2 s + ~1 s (DCMIPP stop timeout) to exit.  Polling at 100 ms
     * keeps responsiveness without burning CPU.  Without this wait, the
     * next AppMediaSourcePort_Start() can race: two media tasks touching
     * the same DCMIPP hardware simultaneously.                            */
    while( xMediaCtx.xTaskHandle != NULL )
    {
        vTaskDelay( pdMS_TO_TICKS( 100 ) );
    }

    mp_raw_puts( "[MP] Stop<\r\n" );
}

void AppMediaSourcePort_Destroy( void )
{
    MediaEnc_DeInit();

    /* Frame buffers are static arrays in .psram_bss — nothing to free */
    xMediaCtx.pucEncodedFrame = NULL;
}

void AppMediaSourcePort_PlayAudioFrame( MediaFrame_t * pxFrame )
{
    /* No audio output capability on this board */
    ( void ) pxFrame;
}
